/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_printf_utils.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jislim <jislim@student.42seoul.kr>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/03/30 00:57:31 by jislim            #+#    #+#             */
/*   Updated: 2022/04/03 23:06:45 by jislim           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/ft_printf.h"

void	hexa_print(unsigned long n, char d)
// 왜 unsigned int로 받냐?
// 일단 포인터의 주소를 숫자로 바꿔야 출력이 가능.
// 16진수이기 때문에 포인터의 주소를 숫자로 바꾸면 자리수가 int로 안됨.
// 그래서 unsigned int로 해줌.
{
	char	c;

	c = n % 16;
	if (n >= 16)
		hexa_print(n / 16, d);
	if (c >= 0 && c < 10)
		c += '0';
	else if (d == 'X' && c >= 10 && c < 16)
		c = c - 10 + 'A';
	else if ((d == 'x' || d == 'p')
            && (c >= 10 && c < 16))
		c = c - 10 + 'a';
	write(1, &c, 1);
}
